jschornick/ecen5613/lab4/at89c51/src/lab4.c
// File       : lab4.c
// Author     : Jeff Schornick
//
// Implements the required functionality for ECEN5613 Lab 4.
//
// Specifically, ...
//
// Compilation: Supports SDCC v3.6+, see included makefile for invocation
// Version    : See GitHub repository jschornick/ecen5613 for revision details

#include <stdio.h>  // printf
#include <stdint.h>
#include "serial.h"
#include "at89c51rc2.h"
#include "lcd.h"
#include "eeprom.h"

#define printf printf_tiny

#define NIBBLE_TO_ASCII(x) ( (x)<10 ? (x)+'0' : (x)+'A'-10 )

void dump_screen(void)
{
  uint8_t row, col;
  uint8_t c;
  uint8_t addr;

  printf("  01234567890ABCDEF\r\n");
  printf(" ------------------\r\n");

  addr = lcd_getaddr();
  for(row=0; row<LCD_ROWS; row++) {
    lcd_gotoxy(row,0);
    putchar(row+'0');
    putchar('|');
    for(col=0; col<LCD_COLS; col++) {
      c = lcd_getchar();
      if( (c>=32) && (c<=126) ) {
        putchar(c);
      } else {
        putchar('~');
      }
    }
    putchar('|');
    putchar('\r');
    putchar('\n');
  }
  printf(" ------------------\r\n");
  lcd_gotoaddr(addr);
}

void dump_ddram(void)
{
  uint8_t addr = 0;
  uint8_t c = 0;

  printf("\r\nLCD DDRAM:\r\n");
  printf("----------");

  for(addr = 0; addr <= 0x7f; addr++) {
    // Seek every time since reading out-of-bounds memory does
    // not advance the internal address pointer
    lcd_gotoaddr(addr);
    if ((addr & 0xf) == 0) {
      putchar('\r');
      putchar('\n');
      putchar(NIBBLE_TO_ASCII(addr>>4));
      putchar(NIBBLE_TO_ASCII(addr&0xf));
      putchar(':');
    }
    c = lcd_getchar();
    putchar(' ');
    putchar(NIBBLE_TO_ASCII(c>>4));
    putchar(NIBBLE_TO_ASCII(c&0xf));
  }
  putchar('\r');
  putchar('\n');
}

void dump_cgram(void)
{
  uint8_t i;
  uint8_t c = 0;

  printf("\r\nLCD CGRAM:\r\n");
  printf("----------");

  lcd_cgram_addr(0x0);
  for(i=0; i<64; i++) {
    if ((i & 0xf) == 0) {
      putchar('\r');
      putchar('\n');
      putchar(NIBBLE_TO_ASCII(i>>4));
      putchar(NIBBLE_TO_ASCII(i&0xf));
      putchar(':');
    }
    c = lcd_getchar();
    putchar(' ');
    putchar(NIBBLE_TO_ASCII(c>>4));
    putchar(NIBBLE_TO_ASCII(c&0xf));
  }
  putchar('\r');
  putchar('\n');
}


// Function: read_hex
//
// Reads a hex value (0-9a-f) from the serial port.
//
// Returns: A 8-bit value (0-15) read from serial
uint8_t read_hex(void) {
  uint16_t val = 0;
  char c;
  while( val == 0 ) {
    c = getchar();
    if ( (c >= '0') && (c <= '9') ) {
      putchar(c);
      val = c - '0';
    }
    if ( (c >= 'a') && (c <= 'f') ) {
      val = c - ('a' - 10);
      putchar(c);
    }
  }
  return val;
}


#define ASCII_ESC 27
#define ASCII_ETX 3

#define CS_UP    'A'
#define CS_DOWN  'B'
#define CS_LEFT  'D'
#define CS_RIGHT 'C'

#define TYPE_MODE_NORM 0
#define TYPE_MODE_ESC  1
#define TYPE_MODE_CS   2

void cmd_type(void)
{
  __data uint8_t mode = TYPE_MODE_NORM;
  __data char c = 0 ;
  __data char str[2] = {'\0', '\0'};
  __data uint8_t row, col;

  printf("Type a message on the LCD, ^C to exit...\r\n");
  while (c != ASCII_ETX) {
    c = getchar();  // block until input
    switch (mode) {
    case TYPE_MODE_NORM:
      if( (c>=32) && (c<=126)) {
        *str = c;
        lcd_putstr(str);
      } else if (c == ASCII_ESC) {
        mode = TYPE_MODE_ESC;
      }
      break;
    case TYPE_MODE_ESC:
      /* reading escape character */
      switch (c) {
      case '[':
        mode = TYPE_MODE_CS;
        break;
      case 'c':
        lcd_clear();
        mode = TYPE_MODE_NORM;
        break;
      case ASCII_ESC:
        printf("! Double-escape\r\n");
        break;
      default:
        if( (c>='0') && (c<='7')) {
          lcd_putch(c-'0');  // CGRAM character
        } else {
          printf("! Unknown escape sequence: %u ('%c')\r\n",c,c);
        }
        mode = TYPE_MODE_NORM;
        break;
      }
      break;
    case 2:
      /* reading control sequeunce */
      lcd_getxy(&row, &col);
      //printf("Old pos: (%u,%u)\r\n", row, col);
      switch (c) {
      case CS_UP:
        row = (row + (LCD_ROWS-1)) % LCD_ROWS;
        lcd_gotoxy(row, col);
        break;
      case CS_DOWN:
        row = (row+1) % LCD_ROWS;
        lcd_gotoxy(row, col);
        break;
      case CS_RIGHT:
        col = (col+1) % LCD_COLS;
        lcd_gotoxy(row, col);
        break;
      case CS_LEFT:
        col = (col + (LCD_COLS-1)) % LCD_COLS;
        lcd_gotoxy(row, col);
        break;
      default:
        printf("! Unknown control sequence: %u ('%c')\r\n",c,c);
      }
      //printf("New pos: (%u,%u) @ %02x\r\n", row, col, lcd_getaddr());
      mode = TYPE_MODE_NORM;
    }
  } /* while !ETX */

}


// Command key definitions for the menu
#define KEY_DDRAM    'D'  // Dump LCD DDRAM
#define KEY_CGRAM    'G'  // Dump LCD CGRAM
#define KEY_SCREEN   'S'  // Dump LCD Screen contents
#define KEY_TYPE     'T'  // Type on LCD
#define KEY_CLEAR    'C'  // Clear the LCD


void lcd_welcome(void)
{
  // Smiley face
  lcd_cgram_addr(0x0);
  lcd_putch(0x1b);
  lcd_putch(0x1b);
  lcd_putch(0x00);
  lcd_putch(0x04);
  lcd_putch(0x04);
  lcd_putch(0x11);
  lcd_putch(0x0e);
  lcd_putch(0x00);
  lcd_putch(0x1b);

  // Corner decorations
  lcd_gotoxy(0,0);
  lcd_putch(0);
  lcd_gotoxy(1,1);
  lcd_putch(0);
  lcd_gotoxy(2,1);
  lcd_putch(0);
  lcd_gotoxy(3,0);
  lcd_putch(0);
  lcd_gotoxy(0,15);
  lcd_putch(0);
  lcd_gotoxy(1,14);
  lcd_putch(0);
  lcd_gotoxy(2,14);
  lcd_putch(0);
  lcd_gotoxy(3,15);
  lcd_putch(0);

  lcd_gotoxy(1,3);
  lcd_putstr("Welcome to");
  lcd_gotoxy(2,4);
  lcd_putstr("Lab # 4!");

}

// Function: display_menu
//
// Presents the user a simple menu of commands to choose from.
void display_menu(void)
{
  printf("\r\n=== Lab 4 Menu ===\r\n\r\n");
  printf(" %c - Dump LCD screen\r\n", KEY_SCREEN);
  printf(" %c - Dump DDRAM\r\n", KEY_DDRAM);
  printf(" %c - Dump CGRAM\r\n", KEY_CGRAM);
  printf(" %c - Type on LCD\r\n", KEY_TYPE);
  printf(" %c - Clear the LCD\r\n", KEY_CLEAR);
}

// Function: main
//
// ...
void main()
{
  char c;
  /* uint8_t data; */
  uint16_t i = 0;

  P1_2 = 0; // led on
  serial_init_brg();

  printf("\r\n");
  printf("-----------------------\n\r");
  printf("|  Welcome to Lab 4!  |\r\n");
  printf("----------------------- \r\n");
  printf("\r\n");
  printf("Built on %s (%s)\r\n", BUILD_DATE, GIT_COMMIT);
  printf("\r\n");

  printf("Initializing LCD... ");
  lcd_init();
  printf("done!\r\n");

  lcd_welcome();

  display_menu();
  while(1) {

    printf("-> ");
    c = getchar();  // block until input
    printf("\r\n");

    // Run a command based on the received character, or display the menu
    // after an invalid selection
    switch(c) {
    case KEY_SCREEN:
      dump_screen();
      break;
    case KEY_DDRAM:
      dump_ddram();
      break;
    case KEY_CGRAM:
      dump_cgram();
      break;
    case KEY_TYPE:
      cmd_type();
      break;
    case KEY_CLEAR:
      lcd_clear();
      break;
    default:
      display_menu();
      break;
    }
  }


  /* lcd_gotoxy(0,0); */
  /* lcd_putch(0); */
  /* lcd_putch(0); */

  /* printf("Performing eeprom write/read... "); */
  /* eeprom_write(0,0x42,0x23); */
  /* //printf("done\r\n"); */
  /* //printf("Performing eeprom write... "); */
  /* data = 0; */
  /* while( eeprom_busy() ) {i++; }; */
  /* eeprom_read(0,0x42,&data); */
  /* printf("got: %02x after %u NACKs\r\n", data, i); */

}
